const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21

test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
})

// 2 + 5 เท่ากับ ?

test('2 + 5 เท่ากับ ?', ()=> {
  expect(sum(2,5)).toBe(7);
})


//43 + 1 เท่ากับ 44

test('43 + 1 เท่ากับ 44', ()=> {
  expect(sum(43,1)).toBe(44);
})

// 12 + 23 เท่ากับ 35
test('12 + 23 เท่ากับ 35', ()=> {
  expect(sum(12,23)).toBe(35);
})

// 11 + 1 เท่ากับ 12
test('11 + 1 เท่ากับ 12', ()=> {
  expect(sum(11,1)).toBe(12);
})


// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
